# Assignment 6

**Specify which course you are in, COMP 430 or 533:**

COMP: 533

First, the standard preliminary steps.  For security, don't include your ricedb password.

In [2]:
%load_ext sql
%sql postgresql://ricedb:1221@localhost/postgres

/Users/mhrthu/anaconda/envs/py35/lib/python3.5/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated since IPython 4.0. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Users/mhrthu/anaconda/envs/py35/lib/python3.5/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

'Connected: ricedb@postgres'

In [5]:

%%sql

drop table if exists swim cascade;
drop table if exists strokeof cascade;
drop table if exists heat cascade;
drop table if exists event cascade;
drop table if exists participant cascade;
drop table if exists leg cascade;
drop table if exists distance cascade;
drop table if exists stroke cascade;
drop table if exists meet cascade;
drop table if exists org cascade;



drop function if exists inittables();
create or replace function inittables () 
returns void
as $$
  begin
        drop table if exists swim cascade;
        drop table if exists strokeof cascade;
        drop table if exists heat cascade;
        drop table if exists event cascade;
        drop table if exists participant cascade;
        drop table if exists leg cascade;
        drop table if exists distance cascade;
        drop table if exists stroke cascade;
        drop table if exists meet cascade;
        drop table if exists org cascade;

    create table org(
        id varchar(50),
        name varchar(50),
        is_univ boolean,
        primary key (id)
    );

    create table meet(
        name varchar(50),
        start_date date,
        num_days int,
        org_id varchar(50) not null,
        primary key (name),
        foreign key(org_id) references org(id)
    );

    create table stroke (
        stroke varchar(50),
        primary key (stroke)
    );

    create table distance (
        distance int,
        primary key (distance)
    );

    create table leg (
        leg int,
        primary key (leg)
    );

    create table participant(
        id varchar(50),
        gender char(1),
        org_id varchar(50) not null,
        name varchar(50),
        primary key (id),
        foreign key(org_id)references org(id)
    );

    create table event(
        id varchar(50),
        gender char(1),
        distance int not null,
        primary key (id),
        foreign key(distance) references distance(distance)
    );

    create table heat(
       id varchar(50),
       event_id varchar(50),
       meet_name varchar(50),
       primary key (id, event_id, meet_name),
       foreign key(event_id) references event(id),
       foreign key(meet_name) references meet(name)
    );

    create table strokeof(
       event_id varchar(50),
       leg int,
       stroke varchar(50) not null,
       primary key (event_id, leg),
       foreign key(event_id) references event(id),
       foreign key(leg) references leg(leg),
       foreign key(stroke) references stroke(stroke)
    );

    create table swim(
        heat_id varchar(50),
        event_id varchar(50),
        meet_name varchar(50),
        participant_id varchar(50),
        leg int,
        time numeric,
        primary key (participant_id,heat_id, event_id, meet_name),
        foreign key(heat_id, event_id, meet_name) references heat(id, event_id, meet_name),
        foreign key(participant_id) references participant(id),
        foreign key(leg) references leg(leg)
    );
     
end $$ 
language plpgsql;




drop function if exists updateorg(id varchar(50), name varchar(50), is_univ boolean);
drop function if exists updatemeet(name varchar(50), start_dat date,num_days int,org_id varchar(50));
drop function if exists updatestroke(stroke varchar(50));
drop function if exists updatedistance(distance int);
drop function if exists updateleg(leg int);
drop function if exists updateparticipant(id varchar(50), gender char(1), org_id varchar(50), name varchar(50));
drop function if exists updateevent(id varchar(50),gender char(1), distance int);
drop function if exists updateheat(id varchar(50), event_id varchar(50), meet_name varchar(50));
drop function if exists updatestrokeof(event_id varchar(50),leg int, stroke varchar(50)); 
drop function if exists updateswim(heat_id varchar(50), event_id varchar(50), meet_name varchar(50), participant_id varchar(50), leg int, elapsed_time numeric);


-- # org
create or replace function updateorg (id_in varchar(50), name_in varchar(50), is_univ_in boolean) 
returns void
as $$
  begin 
    insert into org(id, name, is_univ) values (id_in, name_in, is_univ_in)
    on conflict (id) do update 
    set name = excluded.name, is_univ = excluded.is_univ;
  end $$ 
language plpgsql;

-- # meet
create or replace function updatemeet(name_in varchar(50), start_date_in date, num_days_in int, org_id_in varchar(50)) 
returns void
as $$
  begin 
    insert into meet values (name_in, start_date_in, num_days_in, org_id_in)
    on conflict (name) do update 
    set start_date = excluded.start_date, num_days = excluded.num_days, org_id = excluded.org_id;
  end $$ 
language plpgsql;

-- # stroke
create or replace function updatestroke(stroke_in varchar(50))
returns void
as $$
  begin 
    if stroke_in = 'freestyle' or
    stroke_in = 'medley' or
    stroke_in = 'butterfly' or
    stroke_in = 'breaststroke' or
    stroke_in = 'backstroke'
    then
        insert into stroke values (stroke_in)
        on conflict (stroke) do nothing;
    end if;
  end $$ 
language plpgsql;

-- # distance
create or replace function updatedistance(distance_in int)
returns void
as $$
  begin 
    if distance_in = 100 or
    distance_in = 200 or
    distance_in = 400
    then
        insert into distance values (distance_in)
        on conflict (distance) do nothing;
    end if;
  end $$ 
language plpgsql;


-- # leg
create or replace function updateleg(leg_in int)
returns void
as $$
  begin 
    if leg_in >= 0 and
    leg_in <= 4
    then
        insert into leg values (leg_in)
        on conflict (leg) do nothing;
    end if;
  end $$ 
language plpgsql;

-- # participant
create or replace function updateparticipant(id_in varchar(50), gender_in char(1), org_id_in varchar(50), name_in varchar(50))
returns void
as $$
  begin 
    if gender_in = 'F' or gender_in = 'M'
    then
        insert into participant values (id_in, gender_in, org_id_in, name_in)
        on conflict (id) do update
        set gender = excluded.gender, org_id = excluded.org_id, name = excluded.name;
    end if;
  end $$ 
language plpgsql;

-- # event
create or replace function updateevent(id_in varchar(50),gender_in char(1), distance_in int)
returns void
as $$
  begin 
    if gender_in = 'F' or gender_in = 'M'
    then
        insert into event values (id_in, gender_in, distance_in)
        on conflict (id) do update
        set gender = excluded.gender, distance = excluded.distance;
    end if;
  end $$ 
language plpgsql;

-- # heat
create or replace function updateheat(id_in varchar(50), event_id_in varchar(50), meet_name_in varchar(50))
returns void
as $$
  begin 
    insert into heat values (id_in, event_id_in, meet_name_in)
    on conflict (id, event_id, meet_name) do nothing;
  end $$ 
language plpgsql;


-- # strokeof
create or replace function updatestrokeof(event_id_in varchar(50),leg_in int, stroke_in varchar(50))
returns void
as $$
  begin 
    insert into strokeof values (event_id_in, leg_in, stroke_in)
    on conflict (event_id, leg) do update
    set stroke = excluded.stroke;
  end $$ 
language plpgsql;

-- # swim
create or replace function updateswim(heat_id_in varchar(50), event_id_in varchar(50), meet_name_in varchar(50), participant_id_in varchar(50), leg_in int, elapsed_time_in numeric)
returns void
as $$
  begin 
    insert into swim values (heat_id_in, event_id_in, meet_name_in, participant_id_in, leg_in, elapsed_time_in)
    on conflict (heat_id, event_id, meet_name, participant_id) do update
    set leg = excluded.leg, time = excluded.time;
  end $$ 
language plpgsql;




create or replace function initviews() 
returns void 
as $$
    begin
        drop view if exists all_info cascade;
        create view all_info as 
        select heat_id, event_id, meet_name, leg, time, participant_id, gender, org_id, participant.name as p_name, org.name as o_name
        from swim
        inner join participant on swim.participant_id = participant.id
        inner join org on participant.org_id = org.id;
        
        -- # all info for non relay events
        drop view if exists nonrelaytb cascade;
        create view nonrelaytb as
        select  *
        from all_info
        where event_id not in (select distinct event_id
                        from strokeof
                        where leg > 1);
        
        -- # all info for relay events
        drop view if exists relaytb;
        create view relaytb as
        select  heat_id, event_id,meet_name,org_id,gender,o_name, sum(time) as total_time, string_agg(p_name, ',') as team_members
        from all_info
        where event_id in (select distinct event_id
                        from strokeof
                        where leg > 1)
        group by heat_id, event_id,meet_name,org_id,gender,o_name;
        
        -- # all stats for non relay events
        drop view if exists nonrelaystats cascade;
        create view nonrelaystats as
        select event_id, meet_name, leg, participant_id, gender, org_id, p_name, o_name, min(time) as best_time, rank() over (partition by event_id,meet_name order by min(time))
        from nonrelaytb
        group by event_id, meet_name, leg, participant_id, gender, org_id, p_name, o_name;
        
        -- # all stats for relay events
        drop view if exists relaystats cascade;
        create view relaystats as
        select event_id, meet_name, gender, org_id, o_name,team_members, min(total_time) as best_total_time, rank() over (partition by event_id,meet_name order by min(total_time))
        from relaytb
        group by event_id, meet_name, gender, org_id, o_name, team_members;
    end; $$
language plpgsql;

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [7]:
%%sql

-- # for a meet, display a heat sheet (no relay part).
drop function if exists meetHs(mt_name varchar(50));

create or replace function meetHs(mt_name varchar(50)) 
returns table(event_id varchar(50), swimmers varchar(50), school varchar(50), best_time float, rank bigint) 
as $$
    declare
        hasmeet int;
    begin    
        select count(*) into hasmeet
        from meet
        where name = mt_name;

        if hasmeet = 0 then
            raise exception 'bad meet name input: there is not such a meet';
        end if;
     
        return query select * from
            (select nonrelaystats.event_id, p_name as team_members, o_name, nonrelaystats.best_time, nonrelaystats.rank
            from nonrelaystats
            where nonrelaystats.meet_name = mt_name     
            union
            select relaystats.event_id, relaystats.team_members, o_name, relaystats.best_total_time as best_time, relaystats.rank 
            from relaystats
            where relaystats.meet_name = mt_name) as sheet
        order by sheet.event_id, sheet.rank;
    end; $$
language plpgsql;



drop function if exists meetPersonHs(mt_name varchar(50), person_id varchar(50));

create or replace function meetPersonHs(mt_name varchar(50), person_id varchar(50)) 
returns table(event_id varchar(50), swimmers varchar(50), school varchar(50), best_time numeric, rank bigint) 
as $$
    declare
        hasmeet int;
        hasperson int;
    begin    
        select count(*) into hasmeet
        from meet
        where name = mt_name;
        
        select count(*) into hasperson
        from participant
        where participant.id = person_id;

        if hasperson = 0 then
            raise exception 'bad participant id input: there is not such a participant';
        end if;

        if hasmeet = 0 then
            raise exception 'bad meet name input: there is not such a meet';
        end if;
         
        return query select * from
            (select nonrelaystats.event_id, p_name as team_members, o_name, nonrelaystats.best_time, nonrelaystats.rank
            from nonrelaystats
            where nonrelaystats.meet_name = mt_name and nonrelaystats.event_id in (select swim.event_id
                                                                                   from swim
                                                                                   where participant_id = person_id)   
            union
            select relaystats.event_id, relaystats.team_members, o_name, relaystats.best_total_time as best_time, relaystats.rank 
            from relaystats
            where relaystats.meet_name = mt_name and relaystats.event_id in (select swim.event_id
                                                                             from swim
                                                                             where participant_id = person_id) ) as sheet
        order by sheet.event_id, sheet.rank;
    end; $$
language plpgsql;


drop function if exists meetOrgHs(mt_name varchar(50), school_id varchar(50));

create or replace function meetOrgHs(mt_name varchar(50), school_id varchar(50)) 
returns table(event_id varchar(50), swimmers varchar(50), school varchar(50), best_time numeric, rank bigint) 
as $$
    declare
        hasmeet int;
        hasuniv int;
    begin    
        select count(*) into hasmeet
        from meet
        where name = mt_name;
        
        select count(*) into hasuniv
        from org
        where id = school_id;

        if hasuniv = 0 then
            raise exception 'bad university id input: there is not such a university(organization)';
        end if;

        if hasmeet = 0 then
            raise exception 'bad meet name input: there is not such a meet';
        end if;
         
        return query select * from
            (select nonrelaystats.event_id, p_name as team_members, o_name, nonrelaystats.best_time, nonrelaystats.rank
            from nonrelaystats
            where nonrelaystats.meet_name = mt_name and nonrelaystats.event_id in (select distinct all_info.event_id
                                                                                   from all_info
                                                                                   where all_info.org_id = school_id)   
            union
            select relaystats.event_id, relaystats.team_members, o_name, relaystats.best_total_time as best_time, relaystats.rank 
            from relaystats
            where relaystats.meet_name = mt_name and relaystats.event_id in (select all_info.event_id
                                                                             from all_info
                                                                             where all_info.org_id = school_id) ) as sheet
        order by sheet.event_id, sheet.rank;
    end; $$
language plpgsql;




drop function if exists swimmerTable(mt_name varchar(50), school_id varchar(50));

create or replace function swimmerTable(mt_name varchar(50), school_id varchar(50)) 
returns table(school varchar(50), event_id varchar(50), swimmers text) 
as $$
    declare
        hasmeet int;
        hasuniv int;
    begin    
        select count(*) into hasmeet
        from meet
        where name = mt_name;
        
        select count(*) into hasuniv
        from org
        where id = school_id;

        if hasuniv = 0 then
            raise exception 'bad university id input: there is not such a university(organization)';
        end if;

        if hasmeet = 0 then
            raise exception 'bad meet name input: there is not such a meet';
        end if;
         
        return query select * 
                     from (select distinct all_info.o_name, all_info.event_id,string_agg(all_info.p_name, ', ') as swimmers
                        from all_info
                        where all_info.org_id = school_id and all_info.meet_name = mt_name and all_info.event_id in (select distinct strokeof.event_id
                                                                                                    from strokeof
                                                                                                    where leg > 1)
                        group by all_info.event_id, all_info.o_name
                        union
                        select distinct nonrelaytb.o_name, nonrelaytb.event_id, nonrelaytb.p_name as swimmers
                        from nonrelaytb
                        where nonrelaytb.org_id = school_id and nonrelaytb.meet_name = mt_name 
                        group by nonrelaytb.event_id, nonrelaytb.o_name, nonrelaytb.p_name) as sheet
                     order by sheet.event_id;
    end; $$
language plpgsql;



drop function if exists eventResult(mt_name varchar(50), ev_id varchar(50));

create or replace function eventResult(mt_name varchar(50), ev_id varchar(50)) 
returns table(event_id varchar(50), swimmers varchar(50), school varchar(50), best_time numeric, rank bigint) 
as $$
    declare
        hasmeet int;
        hasevent int;
    begin    
        select count(*) into hasmeet
        from meet
        where name = mt_name;
        
        select count(*) into hasevent
        from event
        where id = ev_id;

        if hasevent = 0 then
            raise exception 'bad event id input: there is not such a event';
        end if;

        if hasmeet = 0 then
            raise exception 'bad meet name input: there is not such a meet';
        end if;
         
        return query select * from
            (select nonrelaystats.event_id, p_name as team_members, o_name, nonrelaystats.best_time, nonrelaystats.rank
            from nonrelaystats
            where nonrelaystats.meet_name = mt_name and nonrelaystats.event_id = ev_id
            union
            select relaystats.event_id, relaystats.team_members, o_name, relaystats.best_total_time as best_time, relaystats.rank 
            from relaystats
            where relaystats.meet_name = mt_name and relaystats.event_id = ev_id) as sheet
        order by sheet.event_id, sheet.rank;
    end; $$
language plpgsql;


drop function if exists meetScore(mt_name varchar(50));

create or replace function meetScore(mt_name varchar(50)) 
returns table(school varchar(50), scores bigint) 
as $$
    declare
        hasmeet int;
    begin    
        select count(*) into hasmeet
        from meet
        where name = mt_name;
     
        if hasmeet = 0 then
            raise exception 'bad meet name input: there is not such a meet';
        end if;
         
        return query 
        select sheet.o_name, sum(sheet.score) as scores
        from
            (select nonrelay.o_name, case when rank = 1 then 6 
                                      when rank = 2 then 4
                                      when rank = 3 then 3 
                                      when rank = 4 then 2
                                      when rank = 5 then 1
                                      else 0 end as score
            from
                (select nonrelaystats.event_id, p_name as team_members, o_name, nonrelaystats.best_time, nonrelaystats.rank
                from nonrelaystats
                where nonrelaystats.meet_name = mt_name) as nonrelay
            union
            select relay.o_name, case when rank = 1 then 8 
                                      when rank = 2 then 4
                                      when rank = 3 then 2 
                                      else 0 end as score
            from
                (select relaystats.event_id, relaystats.team_members, o_name, relaystats.best_total_time as best_time, relaystats.rank 
                from relaystats
                where relaystats.meet_name = mt_name) as relay) as sheet
        group by sheet.o_name;
    end; $$
language plpgsql;

select inittables();
select initviews();

Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
Done.
1 rows affected.
1 rows affected.

[('',)]